<?php

declare(strict_types=1);

return [
    'col_max_colonies' => '艦隊は指定座標 %s に到着しましたが、残念ながら植民できません。保有できる惑星は最大 %s 個です。',
    'col_successful' => '艦隊は指定座標 %s に到着し、新しい惑星を発見してすぐに開発を始めました。', // ok
    'col_occupied' => '艦隊は指定座標 %s に到着しました。残念ながら、その場所はすでに植民されていました。落胆した入植者たちは帰還するしかありません。', // ok
    'col_astro_level' => '艦隊は指定座標 %s に到着し、惑星が植民に適していることを確認しました。しかし開発を始めてすぐ、入植者たちは自分たちの宇宙物理学の知識では新しい惑星の植民を完了できないことに気づきました。', // ok
    'col_report_from' => '入植者', // ok
    'col_report_title' => '植民レポート', // ok
];
