<?php

declare(strict_types=1);

return [
    'des_report_title' => '月への攻撃', // ok
    'des_report_start' => '%s %s から出発した艦隊が惑星 %s %s の月に到着しました。', // ok
    'des_report_defender' => '防衛側は月の破壊を阻止できませんでした。',
    'des_result_none' => '月の構造を十分に弱めることができなかったため、艦隊は本拠惑星へ帰還します。', // ok
    'des_result_moon' => 'デススターの兵器が月に向けて交互重力子衝撃波を放ちます。振動はやがて巨大な地震となり、ついに衛星を引き裂きました。月の施設はすべて破壊されました。完全な成功です！<br><br>艦隊は本拠惑星へ帰還します。<br>', // ok
    'des_result_ds' => '月の表面が揺れ始めましたが、何かがおかしくなりました。デススターの重力子がデススター自身にも振動を引き起こし、デススターは粉々に砕け散りました。',
    'des_result_both' => 'デススターが交互重力子衝撃砲を衛星に向けます。最初は月の表面で弱い揺れが徐々に強まっていきます。月は変形し始め、引き裂かれます。巨大な瓦礫が艦隊に向かって飛んできます。回避するにはもう遅すぎます。艦隊は瓦礫の雨によって全滅しました。', // ok
    'des_moon_ds_chances' => '月の破壊確率: %d %%、デススター破壊確率: %d %%', // ok
];
