<?php

declare(strict_types=1);

return [
    'exp_report_title' => '遠征結果 %s', // ok

    // found new ships
    'exp_new_ships_1' => '遠征隊は、長く続いた戦争でほぼ破壊された惑星を発見しました。軌道上にはさまざまな艦船が漂っています。技術者たちがその一部を修理しようとしています。ここで何が起きたのかもわかるかもしれません。<br><br>次の艦船が艦隊に加わりました:<br>%s', // ok
    'exp_new_ships_2' => '以前の遠征隊の残骸を見つけました！技術者たちが一部の艦船を再び動かそうとしています。<br><br>次の艦船が艦隊に加わりました:<br>%s', // ok
    'exp_new_ships_3' => '遠征隊は古い自動造船所に遭遇しました。一部の艦船はまだ生産段階にあり、技術者たちが造船所のエネルギー発生装置を再起動しようとしています。<br><br>次の艦船が艦隊に加わりました:<br>%s', // ok
    'exp_new_ships_4' => '放棄された海賊基地を発見しました。格納庫には古い艦船がいくつか残っています。技術者たちがまだ使えるかどうかを調べています。<br><br>次の艦船が艦隊に加わりました:<br>%s', // ok
    'exp_new_ships_5' => '遠征隊は、遥か昔に放棄された植民地の造船所にたどり着きました。格納庫で回収できそうな艦船がいくつか見つかりました。技術者たちが一部を再び飛ばそうとしています。<br><br>次の艦船が艦隊に加わりました:<br>%s', // ok
    'exp_new_ships_6' => '巨大な宇宙船の墓場を発見しました。遠征艦隊の技術者の何人かが、一部の艦船を再び動かすことに成功しました。<br><br>次の艦船が艦隊に加わりました:<br>%s', // ok
    'exp_new_ships_7' => '大艦隊の残骸を発見しました。技術者たちはすぐにほぼ無傷の艦船へ向かい、再び動かそうとしました。<br><br>次の艦船が艦隊に加わりました:<br>%s', // ok

    // found resources
    'exp_new_resources_1' => '孤立した小惑星で採掘しやすい資源鉱床を見つけ、一部の採掘に成功しました。<br><br>%s %s を獲得しました。', // ok
    'exp_new_resources_2' => '遠征隊は資源を採掘できる小さな小惑星を発見しました。<br><br>%s %s を獲得しました。', // ok
    'exp_new_resources_3' => '遠征隊は、積荷を満載したまま放棄された古い輸送船団を発見しました。資源の一部を回収できました。<br><br>%s %s を獲得しました。', // ok
    'exp_new_resources_4' => '独自の大気を持つ小さな月で、遠征隊は巨大な原料の貯蔵地を発見しました。地上の乗組員がこの天然の宝を運び出して積み込もうとしています。<br><br>%s %s を獲得しました。', // ok

    // found primitive enemy
    'exp_primitive_enemy_1' => '原始的な蛮族が、宇宙船とも呼べないような船で攻撃してきました。攻撃が本格化すれば、反撃せざるを得ません。', // ok
    'exp_primitive_enemy_2' => '遠征隊が追った救難信号は、実は宇宙海賊の待ち伏せでした。戦闘は避けられませんでした。', // ok
    'exp_primitive_enemy_3' => '酔った海賊たちの無線通信を傍受しました。まもなく攻撃を受けそうです。', // ok
    'exp_primitive_enemy_4' => '海賊と戦うことになりましたが、幸い数は少数でした。', // ok
    'exp_primitive_enemy_5' => '追い詰められた宇宙海賊たちが遠征艦隊を奪おうとしました。', // ok
    'exp_primitive_enemy_6' => '遠征隊は正体不明の海賊船との激しい戦闘を報告しています。', // ok
    'exp_primitive_enemy_8' => '宇宙海賊の待ち伏せにまともに突っ込んでしまいました！戦闘は避けられませんでした。', // ok

    'exp_pirates_name' => '海賊',
    'exp_aliens_name' => 'エイリアン',

    // found advanced enemy
    'exp_advanced_enemy_1' => '異様な外見の艦船が、警告なしに遠征艦隊を攻撃してきました！', // ok
    'exp_advanced_enemy_2' => '遠征艦隊は未知の種族と敵対的な初接触をしました。', // ok

    // found trader
    'exp_trader' => '遠征艦隊は友好的なエイリアン種族と接触しました。彼らは交易品を持った代表者をあなたの惑星へ送ると告げました。<br><br>次回の商人の呼び出しは無料です。', // ok

    // found dark matter
    'exp_dm_1' => '遠征隊は奇妙な信号をたどって小惑星にたどり着きました。小惑星の核で少量のダークマターが見つかりました。小惑星は確保され、探検隊がダークマターの抽出を試みています。<br><br>%s %s を獲得しました。', // ok
    'exp_dm_2' => '遠征隊は少量のダークマターを運んでいた幽霊船を確保しました。元の乗組員に何が起きたのか手がかりは見つかりませんでしたが、技術者たちはダークマターを回収できました。<br><br>%s %s を獲得しました。', // ok
    'exp_dm_3' => 'エイリアンの船の残骸を発見しました。貨物室の棚に、ダークマターの入った小さな容器がありました！<br><br>%s %s を獲得しました。', // ok
    'exp_dm_4' => '小型船の船内で奇妙なエイリアンに出会い、簡単な計算と引き換えにダークマターの入ったケースをもらいました。<br><br>%s %s を獲得しました。', // ok
    'exp_dm_5' => '遠征隊はダークマターを捕獲し、保管することに成功しました。<br><br>%s %s を獲得しました。', // ok

    // delay
    'exp_delay_1' => '遠征隊は粒子嵐の吹き荒れる宙域に入りました。エネルギー貯蔵装置が過負荷となり、艦船の主要システムのほとんどが停止しました。整備士たちが最悪の事態を防ぎましたが、遠征隊の帰還は大幅に遅れます。', // ok
    'exp_delay_2' => '航法士の重大な計算ミスにより、遠征隊のジャンプは誤った計算で行われました。艦隊は目標を完全に外しただけでなく、帰還にも予定よりはるかに長い時間がかかります。', // ok
    'exp_delay_3' => '新しい航法モジュールにはまだバグがあります。遠征隊のジャンプは誤った方向へ向かっただけでなく、デューテリウムをすべて使い果たしました。幸い、ジャンプの到着地点は出発惑星の月の近くでした。少し落胆した遠征隊は、インパルス推力なしで帰還します。帰還には予想より時間がかかります。', // ok
    'exp_delay_4' => '原因不明のまま、遠征隊のジャンプは完全に失敗しました。危うく太陽の中心に突入するところでした。幸い既知の星系に到着しましたが、帰還のジャンプには予想以上の時間がかかります。', // ok
    'exp_delay_5' => '赤色巨星の太陽風が遠征隊のジャンプを狂わせ、帰還ジャンプの計算にかなりの時間がかかります。その宙域には星々の間の虚空以外に何もありませんでした。艦隊の帰還は予想より遅れます。', // ok

    // advancement
    'exp_faster_1' => '遠征隊は探索した宙域で異常を報告していません。しかし帰還中に太陽風に乗ったため、帰路が短縮されました。遠征隊は少し早く帰還します。', // ok
    'exp_faster_2' => 'エンジンのエネルギーコイルで予期せぬ逆結合が起こり、遠征隊の帰還が早まりました。予定より早く帰還します。最初の報告によると、特筆すべきことは何もなかったようです。', // ok

    // found object
    'exp_found_object_1' => '逃走中の艦隊が、私たちの気をそらして逃げるためにアイテムを置き去りにしました。<br><br>%s がインベントリに追加されました。', // ok
    'exp_found_object_2' => '艦隊が貴重な遺物を発見しました。<br><br>%s がインベントリに追加されました。<br><br>%s がインベントリに追加されました。', // ok

    // found nothing
    'exp_nothing_1' => '遠征隊は超新星の見事な写真を撮影しました。遠征で新たに得たものはありませんが、少なくとも来月号の OGame 誌の「宇宙ベストショット」コンテストで入賞する可能性は十分にあります。', // ok
    'exp_nothing_2' => '純粋なエネルギーでできた生命体が乗り込み、遠征隊の全員を奇妙なトランス状態に陥らせ、コンピュータ画面の催眠的な模様を見つめさせ続けました。ようやく大半が正気に戻ったときには、デューテリウムが少なすぎて任務を中止するしかありませんでした。', // ok
    'exp_nothing_3' => '赤いクラス5の異常は、艦船の航法システムを混乱させるだけでなく、乗組員に強烈な幻覚も引き起こすことがわかりました。遠征隊は何も持ち帰れませんでした。', // ok
    'exp_nothing_4' => '遠征隊の旗艦が、警告なしに艦隊内へジャンプしてきた他所の船と衝突しました。相手の船は爆発し、旗艦も大きな損傷を受けました。この状態では遠征を続けられないため、必要な修理が終わり次第、艦隊は帰還を開始します。', // ok
    'exp_nothing_5' => '未知の沼地惑星から連れてきた風変わりな小動物以外、この遠征で持ち帰った面白いものはありません。', // ok
    'exp_nothing_6' => '遠征隊は、遥か昔に放棄された奇妙な植民地に遭遇しました。着陸後、乗組員たちはエイリアンのウイルスによる高熱に苦しみ始めました。このウイルスが惑星の文明全体を滅ぼしたことが判明しました。遠征隊は病気の乗組員を治療するため帰還します。残念ながら任務を中止し、手ぶらで帰ることになりました。', // ok
    'exp_nothing_7' => '母星系を出てまもなく、奇妙なコンピュータウイルスが航法システムを攻撃し、遠征艦隊は同じ場所をぐるぐる回り続けました。言うまでもなく、遠征はあまり成功しませんでした。', // ok
    'exp_nothing_8' => 'あの砂漠の惑星で艦長の誕生日を祝ったのは良い考えではなかったようです。恐ろしい未知の熱病により、乗組員の大半は旅の残りを医務室で過ごしました。乗組員不足のため遠征は失敗しました。',
    'exp_nothing_9' => '旗艦の炉心の故障で、遠征艦隊全体が危うく壊滅するところでした。幸い技術者たちは非常に有能で、最悪の事態を防ぎました。修理にかなりの時間がかかり、遠征隊は目的を果たせないまま帰還することになりました。', // ok
    'exp_nothing_10' => 'この宙域の最初のスキャンは非常に有望でしたが、残念ながら手ぶらで帰還します。', // ok
    'exp_nothing_11' => '遠征隊は宇宙の果てしない虚空を知ることになりました。この遠征を面白くするような小惑星も放射線も粒子さえもありませんでした。', // ok
    'exp_nothing_12' => '遠征隊は中性子星の重力場に捕まりかけ、脱出にしばらく時間がかかりました。そのため大量のデューテリウムを消費し、遠征艦隊は成果なしで帰還しなければなりませんでした。', // ok
    'exp_nothing_13' => '旗艦の中央コンピュータの故障により、遠征任務は中止されました。残念ながらコンピュータの不具合のため、艦隊は手ぶらで帰還します。', // ok
    'exp_nothing_14' => '任務中、遠征隊は救難信号を受信しました。超大型輸送船が小惑星の強力な重力場に捕まっていたのです。船と積荷を無事に救出すると、船長は救ってくれた人を一番のお得意様にすると約束しました。', // ok
    'exp_nothing_15' => '遠征艦隊はしばらく奇妙な信号を追いました。最終的に、その信号は異星種族に挨拶するために何世代も前に打ち上げられた古い探査機から発信されていたことがわかりました。探査機は回収され、母星のいくつかの博物館がすでに関心を示しています。', // ok
    'exp_nothing_16' => '新任の大胆な司令官は、帰路を短縮するために不安定なワームホールの通過に成功しました！しかし遠征そのものでは何も得られませんでした。', // ok

    // lost ships
    'exp_lost_1' => '遠征隊から残ったのは次の無線通信だけでした: ザザッ…なんてこと！ガガッ…あれは…ザザッ…まるで… うわああ！ザザザザ…<br><br><br><br><br><br>通信終了', // ok

    // exploration status
    'exp_status_fresh_1' => '通信士官の航海日誌より: 宇宙のこの領域はまだ探索されていないようです。', // ok
    'exp_status_fresh_2' => '通信士官の航海日誌より: 未踏の宙域を最初に旅するのは素晴らしい気分です。', // ok
    'exp_status_busy' => '通信士官の航海日誌より: 銀河のこの領域に人類が来たことはないようです。',
    'exp_status_crowded' => '通信士官の航海日誌より: 他の遠征艦隊がいた痕跡を見つけました。',
    'exp_status_overrun' => '通信士官の航海日誌より: 不安を感じたら、この辺りを飛んでいる他の遠征隊といつでも手を組めます。',
];
