<?php

declare(strict_types=1);

return [
    'of_title' => 'オフィサー',
    'of_recruit' => '雇用',
    'of_inactive' => '無効',
    'of_darkmatter_description' => 'ダークマターは、ここ数標準年でようやく保存が可能になった物質で、今なお多大な労力を要します。加工すると想像を絶する量のエネルギーを生み出せます。ダークマターの入手方法は複雑で危険に満ちているため、非常に貴重です。購入済みでまだ残っているダークマターだけが、アカウントを削除から守ります！',
    'of_darkmatter_description_short' => 'この希少な物質でコマンダーやオフィサーを雇えます。',
    'of_get_darkmatter' => 'ダークマターを入手',
    'of_months' => '3ヶ月:',
    'of_week' => '1週間:',
    'of_time_remaining_less' => 'あと %s 日有効',
    'of_time_remaining_one' => '残り1日',
    'of_time_remaining_many' => 'あと %s 日以上有効',
    'of_hire_commander' => 'コマンダーを雇う',
    'of_hire_admiral' => 'アドミラルを雇う',
    'of_hire_engineer' => 'エンジニアを雇う',
    'of_hire_geologist' => 'ジオロジストを雇う',
    'of_hire_technocrat' => 'テクノクラートを雇う',
    'of_add_premium_officier_commander' => 'お気に入り +40、建設キュー、ショートカット、輸送スキャナー、広告なし*（*ゲーム関連の案内を除く）',
    'of_add_premium_officier_admiral' => '最大艦隊スロット +2、最大遠征数 +1、艦隊の退避率向上',
    'of_add_premium_officier_engineer' => '防衛の損失が半減、エネルギー生産量 +10%',
    'of_add_premium_officier_geologist' => '鉱山の生産量 +10%',
    'of_add_premium_officier_technocrat' => 'スパイレベル +2、研究時間 25% 短縮',
    'officiers' => [
        601 => [
            'name' => 'コマンダー',
            'description' => 'コマンダーの役職は現代の戦争において確立されました。指揮系統が簡素化されたことで、命令をより速く処理できます。コマンダーがいれば帝国全体を見渡せます！これにより、敵より一歩先を行く体制を整えられます。',
            'benefits' => 'お気に入り +40、建設キュー、輸送スキャナー、広告なし',
        ],
        602 => [
            'name' => 'アドミラル',
            'description' => '艦隊提督は経験豊富な歴戦の勇士であり、熟練の戦略家です。最も激しい戦闘の中でも状況を把握し、配下の提督たちとの連絡を保つことができます。また優れたプログラマーでもあり、緊急時には戦闘艦隊を指揮するためのスロットを2つ追加できます。さらに遠征スロットを1つ追加し、攻撃成功後の略奪でどの資源を優先するかを艦隊に指示できるようにします。',
            'benefits' => '最大艦隊スロット +2、最大遠征数 +1、艦隊の退避率向上',
        ],
        603 => [
            'name' => 'エンジニア',
            'description' => 'エンジニアはエネルギー管理と防衛能力の専門家です。平時には植民地のエネルギーを増やし、すべての送電網に電力を均等に配分します。敵の攻撃を受けた際には、過負荷を避けながら全電力を直ちに防衛設備へ回し、戦闘での防衛の損失を減らします。',
            'benefits' => '防衛システムの損失が半減、エネルギー生産量 +10%',
        ],
        604 => [
            'name' => 'ジオロジスト',
            'description' => 'ジオロジストは宇宙鉱物学と結晶学の専門家です。冶金と化学でチームを支援するとともに、惑星間通信も担当し、帝国全体の原材料の利用と精製を最適化します。最新の調査機器を使って最適な採掘地点を見つけ、鉱山の生産量を 10% 向上させます。',
            'benefits' => '鉱山の生産量 +10%',
        ],
        605 => [
            'name' => 'テクノクラート',
            'description' => 'テクノクラートのギルドは天才科学者たちで構成されており、人間の論理が通用しない領域で常に彼らの姿を見かけます。何千年もの間、普通の人間がテクノクラートの暗号を解いたことはありません。テクノクラートはその存在だけで帝国の研究者たちを鼓舞します。',
            'benefits' => 'スパイレベル +2、研究時間 25% 短縮',
        ],
    ],
    'of_commanding_staff' => '司令部',
    'of_commanding_staff_benefits' => '5人のオフィサー全員が同時に有効な場合: 艦隊スロット +1、エネルギー生産量 +2%、鉱山の生産量 +2%、スパイレベル +1。',
];
