<?php

declare(strict_types=1);

return [
    'exp_report_title' => '探险结果 %s', // ok

    // found new ships
    'exp_new_ships_1' => '我们的探险队发现了一颗在连番战争中几乎被摧毁的星球。轨道上漂浮着各种舰船。技术人员正在尝试修复其中一部分。也许我们还能弄清这里发生了什么。<br><br>以下舰船现已加入舰队:<br>%s', // ok
    'exp_new_ships_2' => '我们发现了上一支探险队的残骸！技术人员会尝试让其中一些舰船重新运转。<br><br>以下舰船现已加入舰队:<br>%s', // ok
    'exp_new_ships_3' => '我们的探险队遇到了一座古老的自动化造船厂。部分舰船仍处于生产阶段，技术人员正在尝试重新启动造船厂的能源发生器。<br><br>以下舰船现已加入舰队:<br>%s', // ok
    'exp_new_ships_4' => '我们发现了一座废弃的海盗空间站。机库里停着一些旧舰船。技术人员正在判断其中哪些还能用。<br><br>以下舰船现已加入舰队:<br>%s', // ok
    'exp_new_ships_5' => '你的探险队来到了一处早已废弃的殖民地的造船厂。在机库中发现了一些可以回收的舰船。技术人员正在尝试让其中一些重新起飞。<br><br>以下舰船现已加入舰队:<br>%s', // ok
    'exp_new_ships_6' => '我们发现了一个巨大的飞船坟场。探险舰队的几名技术人员成功让其中一些舰船重新运转。<br><br>以下舰船现已加入舰队:<br>%s', // ok
    'exp_new_ships_7' => '我们发现了一支无敌舰队的残骸。技术人员立即前往几乎完好的舰船，尝试让它们重新运转。<br><br>以下舰船现已加入舰队:<br>%s', // ok

    // found resources
    'exp_new_resources_1' => '我们在一颗孤立的小行星上发现了一些容易开采的资源矿床，并成功采集了一部分。<br><br>获得了 %s %s。', // ok
    'exp_new_resources_2' => '你的探险队发现了一颗可以开采资源的小型小行星。<br><br>获得了 %s %s。', // ok
    'exp_new_resources_3' => '你的探险队发现了一支古老的、满载货物却被遗弃的运输船队。部分资源被抢救了出来。<br><br>获得了 %s %s。', // ok
    'exp_new_resources_4' => '在一颗拥有自己大气层的小卫星上，你的探险队发现了巨大的原材料储藏。地面上的船员正在设法开采并装载这份天然宝藏。<br><br>获得了 %s %s。', // ok

    // found primitive enemy
    'exp_primitive_enemy_1' => '一些原始的野蛮人正驾驶着根本称不上飞船的船只攻击我们。如果火力变得猛烈，我们将被迫还击。', // ok
    'exp_primitive_enemy_2' => '探险队追踪的求救信号其实是星际海盗设下的埋伏。战斗无法避免。', // ok
    'exp_primitive_enemy_3' => '我们截获了一些醉醺醺的海盗的无线电通讯。看来我们很快就要遭到攻击了。', // ok
    'exp_primitive_enemy_4' => '我们不得不与一些海盗交战，幸好他们人数不多。', // ok
    'exp_primitive_enemy_5' => '一些走投无路的太空海盗试图劫持我们的探险舰队。', // ok
    'exp_primitive_enemy_6' => '探险队报告与身份不明的海盗船发生了激烈战斗。', // ok
    'exp_primitive_enemy_8' => '我们一头撞进了星际海盗的埋伏！战斗无法避免。', // ok

    'exp_pirates_name' => '海盗',
    'exp_aliens_name' => '外星人',

    // found advanced enemy
    'exp_advanced_enemy_1' => '一些外形奇特的舰船在没有任何警告的情况下攻击了探险舰队！', // ok
    'exp_advanced_enemy_2' => '你的探险舰队与一个未知种族发生了不友好的首次接触。', // ok

    // found trader
    'exp_trader' => '你的探险舰队与一个友好的外星种族取得了联系。他们宣布将派一名带着商品的代表前往你的世界进行交易。<br><br>你下一次召唤商人免费。', // ok

    // found dark matter
    'exp_dm_1' => '探险队追踪一些奇怪的信号来到一颗小行星。在小行星的核心发现了少量暗物质。小行星已被控制，探险者正在尝试提取暗物质。<br><br>获得了 %s %s。', // ok
    'exp_dm_2' => '我们的探险队占领了一艘运送少量暗物质的幽灵船。我们没有找到原船员遭遇了什么的任何线索，但技术人员成功回收了暗物质。<br><br>获得了 %s %s。', // ok
    'exp_dm_3' => '我们发现了一艘外星飞船的残骸。在货舱的架子上发现了一个装有暗物质的小容器！<br><br>获得了 %s %s。', // ok
    'exp_dm_4' => '我们在一艘小船上遇到了一个古怪的外星人，他用一箱暗物质换了几道简单的数学题。<br><br>获得了 %s %s。', // ok
    'exp_dm_5' => '探险队成功捕获并储存了一些暗物质。<br><br>获得了 %s %s。', // ok

    // delay
    'exp_delay_1' => '你的探险队进入了一个充满粒子风暴的区域。能量储存器过载，大部分舰船的主要系统崩溃。机械师们避免了最坏的情况，但探险队将大幅延迟返航。', // ok
    'exp_delay_2' => '你的领航员在计算中犯了严重错误，导致探险队的跳跃计算失误。舰队不仅完全偏离了目标，返航也将比原计划多花很多时间。', // ok
    'exp_delay_3' => '新的导航模块仍有缺陷。探险队的跳跃不仅把他们带错了方向，还耗尽了所有重氢燃料。幸运的是，跳跃让舰队靠近了出发星球的月球。有些失望的探险队现在将在没有脉冲动力的情况下返航。返航时间将比预期更长。', // ok
    'exp_delay_4' => '由于未知原因，探险队的跳跃完全出错。它差点落入一颗恒星的中心。幸运的是，它落在了一个已知的星系，但返回的跳跃将比预想的花更长时间。', // ok
    'exp_delay_5' => '一颗红巨星的太阳风破坏了探险队的跳跃，计算返回跳跃需要相当长的时间。那个区域除了恒星间的虚空什么都没有。舰队将比预期更晚返回。', // ok

    // advancement
    'exp_faster_1' => '你的探险队没有报告所探索区域有任何异常。但舰队在返航时遇到了太阳风，使返程加快。你的探险队将提前一些返回。', // ok
    'exp_faster_2' => '引擎能量线圈中意外的反向耦合加快了探险队的返航，它将比预期更早回家。初步报告称没有什么令人兴奋的发现。', // ok

    // found object
    'exp_found_object_1' => '一支逃跑的舰队丢下了一件物品，以分散我们的注意力，方便他们逃走。<br><br>%s 已加入物品栏。', // ok
    'exp_found_object_2' => '我们的舰队发现了一件珍贵的文物。<br><br>%s 已加入物品栏。<br><br>%s 已加入物品栏。', // ok

    // found nothing
    'exp_nothing_1' => '你的探险队拍下了一颗超新星的绝美照片。这次探险没有获得任何新东西，但至少很有机会赢得下个月 OGame 杂志的“宇宙最佳照片”比赛。', // ok
    'exp_nothing_2' => '一个由纯能量构成的生命体登上飞船，让所有探险队员陷入奇怪的恍惚状态，只能盯着电脑屏幕上催眠般的图案。当大多数人终于清醒过来时，重氢已经所剩无几，探险任务只能中止。', // ok
    'exp_nothing_3' => '现在我们知道，那些红色的 5 级异常不仅会扰乱舰船的导航系统，还会让船员产生严重的幻觉。探险队什么也没带回来。', // ok
    'exp_nothing_4' => '探险队的旗舰与一艘毫无预警地跳入舰队的外来船只相撞。外来船只爆炸，旗舰也严重受损。在这种情况下探险无法继续，所需的维修完成后，舰队将开始返航。', // ok
    'exp_nothing_5' => '除了一些来自未知沼泽星球的古怪小宠物外，这次探险没有带回任何令人兴奋的东西。', // ok
    'exp_nothing_6' => '我们的探险队遇到了一个早已废弃的奇怪殖民地。着陆后，船员开始因外星病毒发起高烧。据了解，这种病毒消灭了该星球上的整个文明。探险队正在返回家园，为患病船员治疗。遗憾的是，我们不得不中止任务，空手而归。', // ok
    'exp_nothing_7' => '离开母星系后不久，一种奇怪的电脑病毒攻击了导航系统，导致探险舰队一直在原地打转。不用说，这次探险并不成功。', // ok
    'exp_nothing_8' => '在那颗沙漠星球上庆祝船长的生日可能不是个好主意。一种可怕的未知高烧让大部分船员在剩余的旅程中都躺在医务室。探险因缺少人手而失败。',
    'exp_nothing_9' => '旗舰反应堆核心的故障几乎摧毁了整支探险舰队。幸运的是，技术人员非常称职，避免了最坏的情况。维修花了相当长的时间，迫使探险队未能完成目标就返航了。', // ok
    'exp_nothing_10' => '尽管对这个区域的初步扫描非常有希望，我们最终还是空手而归。', // ok
    'exp_nothing_11' => '你的探险队领略了太空的无边空旷。这里甚至没有一颗小行星、一点辐射或一个粒子能让这次探险变得有趣。', // ok
    'exp_nothing_12' => '你的探险队险些落入一颗中子星的引力场，花了一些时间才挣脱出来。因此消耗了大量重氢，探险舰队只能一无所获地返回。', // ok
    'exp_nothing_13' => '由于旗舰中央计算机故障，探险任务被迫中止。遗憾的是，由于计算机故障，舰队空手返回。', // ok
    'exp_nothing_14' => '你的探险队在任务中收到了一个求救信号。一艘超大型货船被一颗小行星产生的强大引力场困住。成功解救船只和货物后，船长宣布将把救命恩人视为他最喜爱的独家客户。', // ok
    'exp_nothing_15' => '你的探险舰队追踪了一段时间的奇怪信号。最后他们发现，这些信号来自一个几代人之前为问候外来种族而发射的旧探测器。探测器被回收，你母星上的几家博物馆已经表示了兴趣。', // ok
    'exp_nothing_16' => '新上任的大胆指挥官成功穿过一个不稳定的虫洞，缩短了返航路程！不过，探险本身没有带来任何新东西。', // ok

    // lost ships
    'exp_lost_1' => '探险队唯一留下的只有以下无线电通讯: 滋滋……哦不！咔咔滋滋……那个滋滋……看起来像……啊啊！滋滋滋滋……<br><br><br><br><br><br>通讯中断', // ok

    // exploration status
    'exp_status_fresh_1' => '通讯官日志: 宇宙的这一部分似乎还没有被探索过。', // ok
    'exp_status_fresh_2' => '通讯官日志: 成为第一批穿越未知区域的人感觉真棒。', // ok
    'exp_status_busy' => '通讯官日志: 看起来从来没有人类来过银河的这一部分。',
    'exp_status_crowded' => '通讯官日志: 我们发现了其他探险舰队存在的迹象。',
    'exp_status_overrun' => '通讯官日志: 如果觉得太不安全，我们随时可以和在这一带飞行的其他探险队联手。',
];
