<?php

declare(strict_types=1);

return [
    'mdl_title' => '服务器功能',
    'mdl_sub_title' => '启用或禁用服务器功能。被禁用的模块即使是管理员（GA）也无法使用。',
    'mdl_save' => '保存功能',
    'mdl_modules' => [
        0 => '更新日志',
        1 => '总览',
        2 => '帝国',
        3 => '资源 / 设施',
        4 => '资源设置',
        5 => '商人',
        6 => '研究',
        7 => '造船厂',
        8 => '舰队 / 快捷方式',
        9 => '舰队动向',
        10 => '科技',
        11 => '星系',
        12 => '防御',
        13 => '联盟',
        14 => '论坛',
        15 => '招募军官',
        16 => '统计',
        17 => '搜索',
        18 => '消息',
        19 => '笔记',
        20 => '好友',
        21 => '选项',
        22 => '封禁',
        23 => '战斗报告',
        24 => '信息 / 跳跃门',
    ],
    'mdl_all_ok_message' => '功能已保存！',
];
