<?php

declare(strict_types=1);

return [
    'mdl_title' => 'サーバー機能',
    'mdl_sub_title' => 'サーバー機能を有効または無効にします。無効にしたモジュールは管理者（GA）でも使用できません。',
    'mdl_save' => '機能を保存',
    'mdl_modules' => [
        0 => '更新履歴',
        1 => '概要',
        2 => '帝国',
        3 => '資源 / 施設',
        4 => '資源設定',
        5 => '商人',
        6 => '研究',
        7 => '造船所',
        8 => '艦隊 / ショートカット',
        9 => '艦隊移動',
        10 => 'テクノロジー',
        11 => '銀河',
        12 => '防衛',
        13 => '同盟',
        14 => 'フォーラム',
        15 => 'オフィサーを雇う',
        16 => '統計',
        17 => '検索',
        18 => 'メッセージ',
        19 => 'メモ',
        20 => 'フレンド',
        21 => 'オプション',
        22 => '凍結',
        23 => '戦闘レポート',
        24 => '情報 / ジャンプゲート',
    ],
    'mdl_all_ok_message' => '機能を保存しました！',
];
